In [1]:
import configparser
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
config = configparser.ConfigParser()
config.read('clustertab.config')

['clustertab.config']

In [23]:
db = config['POSTGRES']['PG_DB']
user = config['POSTGRES']['PG_UNAME']
passwd = config['POSTGRES']['PG_PASS']
port = config['POSTGRES']['PG_PORT']
host = config['POSTGRES']['PG_HOST']

In [24]:
db

'retail_db'

In [25]:
credentials = "postgresql://{}:{}@{}:{}/{}".format(user,passwd,host,port,db)

#using psycopg2 to test connection since there are no tables
import psycopg2
try:
    conn = psycopg2.connect(host=host,dbname=db,user=user,password=passwd,port=port)
except Exception as e:
    print(e)
    
conn.set_session(autocommit=True)

try:
    cur = conn.cursor()
    
except:
    print(e)

In [26]:
credentials

'postgresql://postgres:1234@172.17.0.2:5432/retail_db'

In [7]:
#Helper functions to work with the database
def schemaGen(dataframe, schemaName):
    localSchema = pd.io.sql.get_schema(dataframe,schemaName)
    localSchema = localSchema.replace('TEXT','VARCHAR(255)').replace('INTEGER','NUMERIC').replace('\n','').replace('"',"")
    return "".join(localSchema)

#Using pandas read_sql for getting schema
def getSchema(tableName, credentials):
    schema = pd.read_sql("""SELECT * FROM information_schema.columns where table_name='{}'""".format(tableName),con=credentials)
    return schema

#Issue is in using pd.read_sql to write data to the database. so using psycopg2
def queryTable(query):
    try:
        schema = cur.execute(query)
        return 
    except Exception as e:
        print(e)
        
#This doesn't return anything

#Using the pd.read_sql for getting data from db
def queryBase(query):
    requiredTable = pd.read_sql(query,con=credentials)
    return requiredTable

#This returns the dataframe

## Pivoting Rows into Columns

Let us understand how we can pivot rows into columns in Postgres.

* We need to use `crosstab` as part of `FROM` clause to pivot the data. We need to pass the main query to `crosstab` function.
* We need to install `tablefunc` as Postgres superuser to expose functions like crosstab - `CREATE EXTENSION tablefunc;`

```{note}
If you are using environment provided by us, you don't need to install `tablefunc`. If you are using your own environment run this command by logging in as superuser into postgres server to install `tablefunc`.

`CREATE EXTENSION tablefunc;`

However, in some cases you might have to run scripts in postgres. Follow official instructions by searching around.
```

In [8]:
queryBase("""SELECT order_date,
    order_status,
    count(1)
FROM orders
GROUP BY order_date,
    order_status
ORDER BY order_date,
    order_status
LIMIT 18""")

   order_date     order_status  count
0  2013-07-25         CANCELED      1
1  2013-07-25           CLOSED     20
2  2013-07-25         COMPLETE     42
3  2013-07-25          ON_HOLD      5
4  2013-07-25   PAYMENT_REVIEW      3
5  2013-07-25          PENDING     13
6  2013-07-25  PENDING_PAYMENT     41
7  2013-07-25       PROCESSING     16
8  2013-07-25  SUSPECTED_FRAUD      2
9  2013-07-26         CANCELED      3
10 2013-07-26           CLOSED     29
11 2013-07-26         COMPLETE     87
12 2013-07-26          ON_HOLD     19
13 2013-07-26   PAYMENT_REVIEW      6
14 2013-07-26          PENDING     31
15 2013-07-26  PENDING_PAYMENT     59
16 2013-07-26       PROCESSING     30
17 2013-07-26  SUSPECTED_FRAUD      5

In [9]:
queryBase("""SELECT * FROM crosstab(
    'SELECT order_date,
        order_status,
        count(1) AS order_count
    FROM orders
    GROUP BY order_date,
        order_status',
    'SELECT DISTINCT order_status FROM orders ORDER BY 1'
) AS (
    order_date DATE,
    "CANCELED" INT,
    "CLOSED" INT,
    "COMPLETE" INT,
    "ON_HOLD" INT,
    "PAYMENT_REVIEW" INT,
    "PENDING" INT,
    "PENDING_PAYMENT" INT,
    "PROCESSING" INT,
    "SUSPECTED_FRAUD" INT
)
LIMIT 10""")

,order_date,CANCELED,CLOSED,COMPLETE,ON_HOLD,PAYMENT_REVIEW,PENDING,PENDING_PAYMENT,PROCESSING,SUSPECTED_FRAUD
0,2014-04-26,NaN,None,NaN,NaN,NaN,None,NaN,33.0,NaN
1,2014-04-21,NaN,None,NaN,NaN,4.0,None,NaN,NaN,NaN
2,2013-08-15,NaN,None,NaN,NaN,NaN,None,40.0,NaN,NaN
3,2014-01-20,NaN,None,NaN,12.0,NaN,None,NaN,NaN,NaN
4,2014-06-03,NaN,None,NaN,NaN,NaN,None,NaN,NaN,4.0
5,2013-09-14,NaN,None,NaN,NaN,NaN,None,NaN,37.0,NaN
6,2014-07-06,3.0,None,NaN,NaN,NaN,None,NaN,NaN,NaN
7,2014-02-11,NaN,None,NaN,NaN,NaN,None,NaN,25.0,NaN
8,2014-05-07,NaN,None,64.0,NaN,NaN,None,NaN,NaN,NaN
9,2013-12-30,NaN,None,NaN,NaN,NaN,None,NaN,NaN,1.0

## Overview of Analytic Functions

Let us get an overview of Analytics or Windowing Functions as part of **SQL**.

* Aggregate Functions (`sum`, `min`, `max`, `avg`)
* Window Functions (`lead`, `lag`, `first_value`, `last_value`)
* Rank Functions (`rank`, `dense_rank`, `row_number` etc)
* For all the functions when used as part of Analytic or Windowing functions we use `OVER` clause.
* For aggregate functions we typically use `PARTITION BY`
* For global ranking and windowing functions we can use `ORDER BY sort_column` and for ranking and windowing with in a partition or group we can use `PARTITION BY partition_column ORDER BY sort_column`.
* Here is how the syntax will look like.
  * Aggregate - `func() OVER (PARTITION BY partition_column)`
  * Global Rank - `func() OVER (ORDER BY sort_column DESC)`
  * Rank in a partition - `func() OVER (PARTITION BY partition_column ORDER BY sort_column DESC)`
* We can also get cumulative or moving metrics by adding `ROWS BETWEEN` clause. We will see details later.

## Analytic Functions – Aggregations

Let us see how we can perform aggregations with in a partition or group using Windowing/Analytics Functions.

* For simple aggregations where we have to get grouping key and aggregated results we can use **GROUP BY**.
* If we want to get the raw data along with aggregated results, then using **GROUP BY** is not possible or overly complicated.
* Using aggregate functions with **OVER** Clause not only simplifies the process of writing query, but also better with respect to performance.
* Let us take an example of getting employee salary percentage when compared to department salary expense.

## Cumulative or Moving Aggregations

Let us understand how we can take care of cumulative or moving aggregations using Analytic Functions.

* When it comes to Windowing or Analytic Functions we can also specify window spec using `ROWS BETWEEN` clause.
* Even when we do not specify window spec, the default window spec is used. For most of the functions the default window spec is `UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING`. You also have special clauses such as `CURRENT ROW`.
* Here are some of the examples with respect to `ROWS BETWEEN`.
  * `ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING`
  * `ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW`
  * `ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING`
  * `ROWS BETWEEN 3 PRECEDING AND CURRENT ROW` - moving aggregations using current record and previous 3 records.
  * `ROWS BETWEEN CURRENT ROW AND 3 FOLLOWING` - moving aggregations using current record and following 3 records.
  * `ROWS BETWEEN 3 PRECEDING AND 3 FOLLOWING` - moving aggregations based up on 7 records (current record, 3 previous records and 3 following records)
* We can leverage `ROWS BETWEEN` for cumulative aggregations or moving aggregations.
* Here is an example of cumulative sum.

## Analytic Functions – Windowing

Let us go through the list of Windowing functions supported by Postgres.

* `lead` and `lag`
* `first_value` and `last_value`
* We can either use `ORDER BY sort_column` or `PARTITION BY partition_column ORDER BY sort_column` while using Windowing Functions.

The lead and lag also needs additional work.. Same like Merging

## Analytic Functions – Ranking

Let us see how we can assign ranks using different **rank** functions.

* If we have to assign ranks globally, we just need to specify **ORDER BY**
* If we have to assign ranks with in a key then we need to specify **PARTITION BY** and then **ORDER BY**.
* By default **ORDER BY** will sort the data in ascending order. We can change the order by passing **DESC** after order by.
* We have 3 main functions to assign ranks - `rank`, `dense_rank` and `row_number`. We will see the differences between the 3 in a moment.

 Let us understand the difference between **rank**, **dense_rank** and **row_number**.

* We can use either of the functions to generate ranks when the rank field does not have duplicates.
* When rank field have duplicates then row_number should not be used as it generate unique number for each record with in the partition.
* **rank** will skip the ranks in between if multiple people get the same rank while **dense_rank** continue with the next number.

## Analytic Functions - Filtering

Let us go through the solution for getting top 5 daily products based up on the revenue. In that process we will understand how to apply filtering on top of the derived values using analytic functions.

## Ranking and Filtering - Recap

Let us recap the procedure to get top 5 products by revenue for each day.

* We have our original data in **orders** and **order_items**
* We can pre-compute the data or create a view with the logic to generate **daily product revenue**
* Then, we have to use the view or table or even sub query to compute rank
* Once the ranks are computed, we need to use sub query to filter based up on our requirement.

Let us come up with the query to compute daily product revenue.

In [10]:
queryTable("""CREATE TABLE daily_revenue
AS
SELECT o.order_date,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date
""")

In [11]:
queryBase("""SELECT * FROM daily_revenue
ORDER BY order_date
LIMIT 10""")

  order_date   revenue
0 2013-07-25  31547.23
1 2013-07-26  54713.23
2 2013-07-27  48411.48
3 2013-07-28  35672.03
4 2013-07-29  54579.70
5 2013-07-30  49329.29
6 2013-07-31  59212.49
7 2013-08-01  49160.08
8 2013-08-02  50688.58
9 2013-08-03  43416.74

In [12]:
queryTable("""CREATE TABLE daily_product_revenue
AS
SELECT o.order_date,
    oi.order_item_product_id,
    round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
FROM orders o JOIN order_items oi
ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED')
GROUP BY o.order_date, oi.order_item_product_id""")

In [13]:
queryBase("""SELECT * FROM daily_product_revenue
ORDER BY order_date, revenue DESC
LIMIT 10""")

  order_date  order_item_product_id  revenue
0 2013-07-25                   1004  5599.72
1 2013-07-25                    191  5099.49
2 2013-07-25                    957  4499.70
3 2013-07-25                    365  3359.44
4 2013-07-25                   1073  2999.85
5 2013-07-25                   1014  2798.88
6 2013-07-25                    403  1949.85
7 2013-07-25                    502  1650.00
8 2013-07-25                    627  1079.73
9 2013-07-25                    226   599.99

In [14]:
db = 'itversit_hrdb'
user = config['POSTGRES']['PG_UNAME']
passwd = config['POSTGRES']['PG_PASS']
port = config['POSTGRES']['PG_PORT']
host = config['POSTGRES']['PG_HOST']

In [15]:
db

'itversit_hrdb'

In [16]:
credentials = "postgresql://{}:{}@{}:{}/{}".format(user,passwd,host,port,db)

#using psycopg2 to test connection since there are no tables
import psycopg2
try:
    conn = psycopg2.connect(host=host,dbname=db,user=user,password=passwd,port=port)
except Exception as e:
    print(e)
    
conn.set_session(autocommit=True)

try:
    cur = conn.cursor()
    
except:
    print(e)

In [17]:
credentials

'postgresql://postgres:1234@172.17.0.2:5432/itversit_hrdb'

In [18]:
queryBase("""SELECT employee_id, department_id, salary 
FROM employees 
ORDER BY department_id, salary
LIMIT 10""")

   employee_id  department_id   salary
0          200             10   4400.0
1          202             20   6000.0
2          201             20  13000.0
3          119             30   2500.0
4          118             30   2600.0
5          117             30   2800.0
6          116             30   2900.0
7          115             30   3100.0
8          114             30  11000.0
9          203             40   6500.0

In [19]:
queryBase("""SELECT e.employee_id, e.department_id, e.salary,
    ae.department_salary_expense,
    ae.avg_salary_expense,
    round(e.salary/ae.department_salary_expense * 100, 2) pct_salary
FROM employees e JOIN (
    SELECT department_id, 
        sum(salary) AS department_salary_expense,
        round(avg(salary)::numeric, 2) AS avg_salary_expense
    FROM employees
    GROUP BY department_id
) ae
ON e.department_id = ae.department_id
ORDER BY department_id, salary
LIMIT 10""")

,employee_id,department_id,salary,department_salary_expense,avg_salary_expense,pct_salary
0,200,10,4400.0,4400.0,4400.0,100.00
1,202,20,6000.0,19000.0,9500.0,31.58
2,201,20,13000.0,19000.0,9500.0,68.42
3,119,30,2500.0,24900.0,4150.0,10.04
4,118,30,2600.0,24900.0,4150.0,10.44
5,117,30,2800.0,24900.0,4150.0,11.24
6,116,30,2900.0,24900.0,4150.0,11.65
7,115,30,3100.0,24900.0,4150.0,12.45
8,114,30,11000.0,24900.0,4150.0,44.18
9,203,40,6500.0,6500.0,6500.0,100.00

In [20]:
#Using windowing function

queryBase("""SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS department_salary_expense
FROM employees e
ORDER BY e.department_id
LIMIT 10""")

   employee_id  department_id   salary  department_salary_expense
0          200             10   4400.0                     4400.0
1          201             20  13000.0                    19000.0
2          202             20   6000.0                    19000.0
3          114             30  11000.0                    24900.0
4          115             30   3100.0                    24900.0
5          116             30   2900.0                    24900.0
6          117             30   2800.0                    24900.0
7          118             30   2600.0                    24900.0
8          119             30   2500.0                    24900.0
9          203             40   6500.0                     6500.0

In [21]:
#Using windowing function

queryBase("""SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS department_salary_expense,
    round(e.salary / sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) * 100, 2) AS pct_salary
FROM employees e
ORDER BY e.department_id,
    e.salary
LIMIT 10""")

   employee_id  department_id   salary  department_salary_expense  pct_salary
0          200             10   4400.0                     4400.0      100.00
1          202             20   6000.0                    19000.0       31.58
2          201             20  13000.0                    19000.0       68.42
3          119             30   2500.0                    24900.0       10.04
4          118             30   2600.0                    24900.0       10.44
5          117             30   2800.0                    24900.0       11.24
6          116             30   2900.0                    24900.0       11.65
7          115             30   3100.0                    24900.0       12.45
8          114             30  11000.0                    24900.0       44.18
9          203             40   6500.0                     6500.0      100.00

In [22]:
#Using windowing function

queryBase("""SELECT e.employee_id, e.department_id, e.salary,
    sum(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS sum_sal_expense,
    round(avg(e.salary) OVER (
        PARTITION BY e.department_id
    ), 2) AS avg_sal_expense,
    min(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS min_sal_expense,
    max(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS max_sal_expense,
    count(e.salary) OVER (
        PARTITION BY e.department_id
    ) AS cnt_sal_expense
FROM employees e
ORDER BY e.department_id,
    e.salary
LIMIT 10""")

,employee_id,department_id,salary,sum_sal_expense,avg_sal_expense,min_sal_expense,max_sal_expense,cnt_sal_expense
0,200,10,4400.0,4400.0,4400.0,4400.0,4400.0,1
1,202,20,6000.0,19000.0,9500.0,6000.0,13000.0,2
2,201,20,13000.0,19000.0,9500.0,6000.0,13000.0,2
3,119,30,2500.0,24900.0,4150.0,2500.0,11000.0,6
4,118,30,2600.0,24900.0,4150.0,2500.0,11000.0,6
5,117,30,2800.0,24900.0,4150.0,2500.0,11000.0,6
6,116,30,2900.0,24900.0,4150.0,2500.0,11000.0,6
7,115,30,3100.0,24900.0,4150.0,2500.0,11000.0,6
8,114,30,11000.0,24900.0,4150.0,2500.0,11000.0,6
9,203,40,6500.0,6500.0,6500.0,6500.0,6500.0,1

In [27]:
queryBase("""SELECT t.*,
    round(sum(t.revenue) OVER (
        PARTITION BY to_char(order_date, 'yyyy-MM')
        ORDER BY order_date
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ), 2) AS cumulative_daily_revenue
FROM daily_revenue t
ORDER BY to_char(order_date, 'yyyy-MM'),
    order_date
LIMIT 10""")

  order_date   revenue  cumulative_daily_revenue
0 2013-07-25  31547.23                  31547.23
1 2013-07-26  54713.23                  86260.46
2 2013-07-27  48411.48                 134671.94
3 2013-07-28  35672.03                 170343.97
4 2013-07-29  54579.70                 224923.67
5 2013-07-30  49329.29                 274252.96
6 2013-07-31  59212.49                 333465.45
7 2013-08-01  49160.08                  49160.08
8 2013-08-02  50688.58                  99848.66
9 2013-08-03  43416.74                 143265.40

In [29]:
queryBase("""SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20""")

   order_date   revenue  moving_3day_revenue
0  2013-07-25  31547.23             31547.23
1  2013-07-26  54713.23             86260.46
2  2013-07-27  48411.48            134671.94
3  2013-07-28  35672.03            138796.74
4  2013-07-29  54579.70            138663.21
5  2013-07-30  49329.29            139581.02
6  2013-07-31  59212.49            163121.48
7  2013-08-01  49160.08            157701.86
8  2013-08-02  50688.58            159061.15
9  2013-08-03  43416.74            143265.40
10 2013-08-04  35093.01            129198.33
11 2013-08-05  34025.27            112535.02
12 2013-08-06  57843.89            126962.17
13 2013-08-07  45525.59            137394.75
14 2013-08-08  33549.47            136918.95
15 2013-08-09  29225.16            108300.22
16 2013-08-10  46435.04            109209.67
17 2013-08-11  31155.50            106815.70
18 2013-08-12  59014.74            136605.28
19 2013-08-13  17956.88            108127.12

In [32]:
queryBase("""SELECT t.*,
    round(sum(t.revenue) OVER (
        ORDER BY order_date
        ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING
    ), 2) AS moving_3day_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 20""")

   order_date   revenue  moving_3day_revenue
0  2013-07-25  31547.23            134671.94
1  2013-07-26  54713.23            170343.97
2  2013-07-27  48411.48            224923.67
3  2013-07-28  35672.03            242705.73
4  2013-07-29  54579.70            247204.99
5  2013-07-30  49329.29            247953.59
6  2013-07-31  59212.49            262970.14
7  2013-08-01  49160.08            251807.18
8  2013-08-02  50688.58            237570.90
9  2013-08-03  43416.74            212383.68
10 2013-08-04  35093.01            221067.49
11 2013-08-05  34025.27            215904.50
12 2013-08-06  57843.89            206037.23
13 2013-08-07  45525.59            200169.38
14 2013-08-08  33549.47            212579.15
15 2013-08-09  29225.16            185890.76
16 2013-08-10  46435.04            199379.91
17 2013-08-11  31155.50            183787.32
18 2013-08-12  59014.74            196605.61
19 2013-08-13  17956.88            199737.25

In [33]:
queryBase("""SELECT t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) AS rnk
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30""")

   order_date  order_item_product_id   revenue  rnk
0  2013-07-25                   1004   5599.72    1
1  2013-07-25                    191   5099.49    2
2  2013-07-25                    957   4499.70    3
3  2013-07-25                    365   3359.44    4
4  2013-07-25                   1073   2999.85    5
5  2013-07-25                   1014   2798.88    6
6  2013-07-25                    403   1949.85    7
7  2013-07-25                    502   1650.00    8
8  2013-07-25                    627   1079.73    9
9  2013-07-25                    226    599.99   10
10 2013-07-25                     24    319.96   11
11 2013-07-25                    821    207.96   12
12 2013-07-25                    625    199.99   13
13 2013-07-25                    705    119.99   14
14 2013-07-25                    572    119.97   15
15 2013-07-25                    666    109.99   16
16 2013-07-25                    725    108.00   17
17 2013-07-25                    134    100.00   18
18 2013-07-25                    906     99.96   19
19 2013-07-25                    828     95.97   20
20 2013-07-25                    810     79.96   21
21 2013-07-25                    924     79.95   22
22 2013-07-25                    926     79.95   22
23 2013-07-25                     93     74.97   24
24 2013-07-25                    835     63.98   25
25 2013-07-25                    897     49.98   26
26 2013-07-26                   1004  10799.46    1
27 2013-07-26                    365   7978.67    2
28 2013-07-26                    957   6899.54    3
29 2013-07-26                    191   6799.32    4

In [34]:
queryBase("""SELECT
    t.*,
    rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rnk,
    dense_rank() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) drnk,
    row_number() OVER (
        PARTITION BY order_date
        ORDER BY revenue DESC
    ) rn
FROM daily_product_revenue AS t
ORDER BY order_date, revenue DESC
LIMIT 30""")

   order_date  order_item_product_id   revenue  rnk  drnk  rn
0  2013-07-25                   1004   5599.72    1     1   1
1  2013-07-25                    191   5099.49    2     2   2
2  2013-07-25                    957   4499.70    3     3   3
3  2013-07-25                    365   3359.44    4     4   4
4  2013-07-25                   1073   2999.85    5     5   5
5  2013-07-25                   1014   2798.88    6     6   6
6  2013-07-25                    403   1949.85    7     7   7
7  2013-07-25                    502   1650.00    8     8   8
8  2013-07-25                    627   1079.73    9     9   9
9  2013-07-25                    226    599.99   10    10  10
10 2013-07-25                     24    319.96   11    11  11
11 2013-07-25                    821    207.96   12    12  12
12 2013-07-25                    625    199.99   13    13  13
13 2013-07-25                    705    119.99   14    14  14
14 2013-07-25                    572    119.97   15    15  15
15 2013-07-25                    666    109.99   16    16  16
16 2013-07-25                    725    108.00   17    17  17
17 2013-07-25                    134    100.00   18    18  18
18 2013-07-25                    906     99.96   19    19  19
19 2013-07-25                    828     95.97   20    20  20
20 2013-07-25                    810     79.96   21    21  21
21 2013-07-25                    924     79.95   22    22  22
22 2013-07-25                    926     79.95   22    22  23
23 2013-07-25                     93     74.97   24    23  24
24 2013-07-25                    835     63.98   25    24  25
25 2013-07-25                    897     49.98   26    25  26
26 2013-07-26                   1004  10799.46    1     1   1
27 2013-07-26                    365   7978.67    2     2   2
28 2013-07-26                    957   6899.54    3     3   3
29 2013-07-26                    191   6799.32    4     4   4

In [35]:
queryBase("""SELECT * FROM (
    SELECT nq.*,
        dense_rank() OVER (
            PARTITION BY order_date
            ORDER BY revenue DESC
        ) AS drnk
    FROM (
        SELECT o.order_date,
            oi.order_item_product_id,
            round(sum(oi.order_item_subtotal)::numeric, 2) AS revenue
        FROM orders o 
            JOIN order_items oi
                ON o.order_id = oi.order_item_order_id
        WHERE o.order_status IN ('COMPLETE', 'CLOSED')
        GROUP BY o.order_date, oi.order_item_product_id
    ) nq
) nq1
WHERE drnk <= 5
ORDER BY order_date, revenue DESC
cv
LIMIT 20""")

   order_date  order_item_product_id   revenue  drnk
0  2013-07-25                   1004   5599.72     1
1  2013-07-25                    191   5099.49     2
2  2013-07-25                    957   4499.70     3
3  2013-07-25                    365   3359.44     4
4  2013-07-25                   1073   2999.85     5
5  2013-07-26                   1004  10799.46     1
6  2013-07-26                    365   7978.67     2
7  2013-07-26                    957   6899.54     3
8  2013-07-26                    191   6799.32     4
9  2013-07-26                   1014   4798.08     5
10 2013-07-27                   1004   9599.52     1
11 2013-07-27                    191   5999.40     2
12 2013-07-27                    957   5699.62     3
13 2013-07-27                   1073   5399.73     4
14 2013-07-27                    365   5099.15     5
15 2013-07-28                   1004   5599.72     1
16 2013-07-28                    957   5099.66     2
17 2013-07-28                    365   4799.20     3
18 2013-07-28                    403   4419.66     4
19 2013-07-28                    191   4299.57     5

In [36]:
queryBase("""
SELECT * FROM (SELECT dpr.*,
  dense_rank() OVER (
    PARTITION BY order_date
    ORDER BY revenue DESC
  ) AS drnk
FROM daily_product_revenue AS dpr) q
WHERE drnk <= 5
ORDER BY order_date, revenue DESC
LIMIT 20""")

   order_date  order_item_product_id   revenue  drnk
0  2013-07-25                   1004   5599.72     1
1  2013-07-25                    191   5099.49     2
2  2013-07-25                    957   4499.70     3
3  2013-07-25                    365   3359.44     4
4  2013-07-25                   1073   2999.85     5
5  2013-07-26                   1004  10799.46     1
6  2013-07-26                    365   7978.67     2
7  2013-07-26                    957   6899.54     3
8  2013-07-26                    191   6799.32     4
9  2013-07-26                   1014   4798.08     5
10 2013-07-27                   1004   9599.52     1
11 2013-07-27                    191   5999.40     2
12 2013-07-27                    957   5699.62     3
13 2013-07-27                   1073   5399.73     4
14 2013-07-27                    365   5099.15     5
15 2013-07-28                   1004   5599.72     1
16 2013-07-28                    957   5099.66     2
17 2013-07-28                    365   4799.20     3
18 2013-07-28                    403   4419.66     4
19 2013-07-28                    191   4299.57     5